[
  [], 
  [], 
  [], 
  [
    [
      "The video was the most interesting part. Eventhough the people are not strictly designing a software, the design/prototyping process and group working style is really relevant to how a software design cycle should be like.", 
      3.0
    ], 
    [
      "The video~ I am really surprised that the shopping car was designed only in 5 days. And the process was amazing.", 
      3.0
    ], 
    [
      "I liked seeing how different companies go through the designing process to create new and innovate things. I liked how this applied to mobile design as well.", 
      3.0
    ], 
    [
      "The redesign of the shopping cart was fascinating to watch the process behind.", 
      3.0
    ], 
    [
      "Seeing a brainstorming session in action at IDEO was really interesting. Reading the article prior to class was also interesting and will be useful for the group assignment.", 
      1.0
    ], 
    [
      "I found it interesting how many products that IDEO actually made from so many different markets. I thought most people used product experts, not design experts to make new innovations in products.", 
      3.0
    ], 
    [
      "I learned a lot from the video on the design team.", 
      2.0
    ], 
    [
      "What I found most interesting was the video. It really explained well that innovation is possible in seemingly impossible situations.", 
      3.0
    ], 
    [
      "The final product will be better if it the combination of a number of different prototypes, and for that reason seemingly bad ideas should not be immediately dismissed. parts of them may be salvageable.", 
      3.0
    ], 
    [
      "How to hold a brainstorm meeting.", 
      1.0
    ], 
    [
      "The way that IDEO uses a strict process to innovate and come up with their ideas instead of just brainstorming and jumping on an idea.", 
      3.0
    ], 
    [
      "The video was interesting and how much thought can be put into the actual brainstorming process itself.", 
      1.0
    ], 
    [
      "I found the information about the steps that Ideo takes when approaching a design problem to be very interesting. The reminder that failure during the design process is normal and healthy was also really good.", 
      3.0
    ], 
    [
      "I found the video of designing the shopping cart the most interesting. It was interesting to see the process apply to solve a real life problem and then to understand how we can use it in our own design processes for software and user interfaces.", 
      3.0
    ], 
    [
      "Really enjoyed the IDEO video and design process.", 
      2.0
    ], 
    [
      "The explanation of how the code of android applications are organized", 
      3.0
    ], 
    [
      "the design cycle of the shopping cart", 
      3.0
    ], 
    [
      "The iterative design process and how important it is to test your app at low-fidelity as much as possible", 
      3.0
    ], 
    [
      "The introduction of Android components clarified some concepts that I did not pay attention to when I had some practice in Android programming in the past. Also, like the video and it did show a great process of brainstorming.", 
      3.0
    ], 
    [
      "IDEO design process, following along how they designed their shopping cart.", 
      3.0
    ], 
    [
      "I really enjoyed the video and just seeing our reading come to life; it sort of validated all of the advice given in the reading to a see a group of people so active and creative in their brainstorming process. It was especially interesting to learn about the eclectic mix of people involved in the company. The fact that many of them are just smart and creative and not necessarily engineers or experts in what they are designing is amazing.", 
      3.0
    ], 
    [
      "I liked the video that showed the process of redesigning a shopping cart. It did a good job of illustrating all of the steps in the process.", 
      3.0
    ], 
    [
      "the necessity of different stages of prototype development. Starting in different mediums to sketch up ideas faster and transitioning into the production medium for the end of the design stage seems very important.", 
      3.0
    ], 
    [
      "The four components to Android application development, especially activities. The design/brainstorming video and slides How mobile app development is different from skyscraper building", 
      3.0
    ], 
    [
      "The movie we watched about the design process", 
      3.0
    ], 
    [
      "The waterfall method is not very effective because of changing customer requirements and design changes made by the team. It requires little to no change to work which is pretty rare in software development.", 
      3.0
    ], 
    [
      "This lecture was pretty straightforward to understand", 
      0.0
    ], 
    [
      "No confusion actually~~~", 
      0.0
    ], 
    [
      "Nothing really struck me as confusing, but there was an abundance of terminology that was glanced over and I think it could have been explained in more depth", 
      0.0
    ], 
    [
      "I wish there were more examples of fragments and when to use which as well as the best practices behind them.", 
      3.0
    ], 
    [
      "When the first individual assignment is due was the only confusing part of this lecture.", 
      1.0
    ], 
    [
      "I didn't find anything confusing.", 
      0.0
    ], 
    [
      "It's hard to hear the video in the back.", 
      1.0
    ], 
    [
      "I don't feel as if anything during this lecture was unclear.", 
      0.0
    ], 
    [
      "It seems like even in some software applications, the waterfall approach might be preferable, for instance if it is difficult to test prototypes or collect info from users.", 
      3.0
    ], 
    [
      "Agile development was not mentioned", 
      2.0
    ], 
    [
      "The differences between views and fragments", 
      3.0
    ], 
    [
      "Maybe more about how to stop going off on a tangent while brainstorming.", 
      3.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "The ending of the lecture felt rushed. I also felt like I don't have a very clear understanding of what an activity, intent, fragment, and view is. It would be helpful to have more concrete definitions for each", 
      1.0
    ], 
    [
      "Nothing, really.", 
      0.0
    ], 
    [
      "I did wish the information on Android code organization was more clearly explained. My main suggestion would be to actually use android studio while explaining concepts", 
      3.0
    ], 
    [
      "Android application components", 
      2.0
    ], 
    [
      "I think everything was fairly clear.", 
      0.0
    ], 
    [
      "All good", 
      0.0
    ], 
    [
      "Went through design cycle a bit quickly.", 
      1.0
    ], 
    [
      "The beginning of the class talking about what goes into the making of an Android application. I had a hard time following about the layers and the .xml file that we supposedly need to be so careful with.", 
      3.0
    ], 
    [
      "Everything was clear", 
      0.0
    ], 
    [
      "how to actually implement the design concepts like fragments, activities, intents in android studio", 
      3.0
    ], 
    [
      "The notes on the waterfall model were confusing. If it is outdated, then why is it even taught/worth mentioning?", 
      1.0
    ], 
    [
      "a little more emphasis on concept refinement and the idea of jumping in the brainstorming rules", 
      3.0
    ], 
    [
      "I did not find anything confusing particularly because I just finished a software engineering course last term.", 
      0.0
    ]
  ], 
  [], 
  [], 
  [], 
  [], 
  [
    [
      "I really like how in the beginning of our class we went over the recycler view and cardView and how they apply to modern mobile design. Mobile interface design is changing drastically in recent years, so I strongly prefer linking our course topics with the most up-to-date examples over historic examples and videos", 
      3.0
    ], 
    [
      "I liked learning about the recycling view, it was enjoyable learning about somehow that is useful and gave me ideas for my group project on how I might use it. I also liked going through the story boarding and thought it was interesting how it applied to mobile design", 
      3.0
    ], 
    [
      "Hearing more about the recycler view and how to use it was my favorite part of the lecture. It makes a lot more sense now and doesn't seem to be too difficult to implement.", 
      3.0
    ], 
    [
      "Thinking about testing and doing user interviews was  interesting.", 
      3.0
    ], 
    [
      "I liked the theory of the Wizard of Oz testing. The name works well with the process.", 
      3.0
    ], 
    [
      "Having dynamic views via RecyclerView.", 
      3.0
    ], 
    [
      "I thought it was interesting that the features that are most apparent to users (such as the appearance), are the last steps in the design process.", 
      3.0
    ], 
    [
      "I liked the story about pixar story boarding.", 
      3.0
    ], 
    [
      "I thought the section on story boarding was quite interesting, especially the life cycle of the animation I thought the section on story boarding was quite interesting, especially the life cycle of the animation", 
      3.0
    ], 
    [
      "The Recycler and Card views were very helpful", 
      3.0
    ], 
    [
      "I enjoyed the real world example of how Pixar uses lo-if prototyping. It gives a good perspective of how important it is to prototype and how to prototype as well.", 
      3.0
    ], 
    [
      "recycler view", 
      1.0
    ], 
    [
      "the combination of recycleview and cardview seem to be very promising tools to display lists. I will definitely implement them in my project", 
      3.0
    ], 
    [
      "Congratulations on your award! And the ten steps for evaluation interest me most.", 
      1.0
    ], 
    [
      "I really enjoyed the analogous pixar video you used. I think that videos like this grabs the classes attention, and provides and interesting and unique approach to teaching that is not the standard 'powerpoint' type teaching.", 
      3.0
    ], 
    [
      "How card view works.", 
      3.0
    ], 
    [
      "Android elements of card view and recycle view.", 
      3.0
    ], 
    [
      "I liked the general info about lo-fi prototyping and specifically the tips about how to interact with users and make the most out of a testing session. All of these ideas are very new to me and I had no idea so much more can go into the design process than just thinking and talking.", 
      3.0
    ], 
    [
      "The Pixar video", 
      2.0
    ], 
    [
      "I liked the monsters inc video because it showed this is used outside of apps", 
      3.0
    ], 
    [
      "low-fi", 
      1.0
    ], 
    [
      "I found that the recycle view and card view interesting because many of the apps commonly used today use those views as their structure. We can utilize optimizations made by those views to create powerful applications that were very difficult to create before.", 
      3.0
    ], 
    [
      "I didn't understand the wizard of oz mode", 
      2.0
    ], 
    [
      "Everything was fairly clear.", 
      0.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "The full implementation of the individual card view", 
      3.0
    ], 
    [
      "There are things designed for general users!!! From the car example, what about the family sedan? That's what most people drive.", 
      3.0
    ], 
    [
      "Nothing came off as confusing, the bulk of the class was on prototyping which was somewhat straight forward", 
      0.0
    ], 
    [
      "Still a little confused about how Hi-Fi prototyping is distinguishable from Lo-Fi prototyping. To my understanding, it is just a more exact, precise, and tedious version of Lo-Fi prototyping.", 
      3.0
    ], 
    [
      "I wasn't quite sure what the difference was between the recycle view and card view.", 
      3.0
    ], 
    [
      "Everything at the beginning, esp implementation of the array", 
      3.0
    ], 
    [
      "Again it wasn't particularly confusion, but the most difficult part to follow was about RecycleView because there wasn't as much explanation on the slides but there was syntax that was hard to follow while the professor was still speaking.", 
      1.0
    ], 
    [
      "Nothing really. Enjoyed hearing about user personas and prototyping.", 
      0.0
    ], 
    [
      "Nothing was all that confusing. It would have been nicer to talk more about the recycler view. However the part of the lecture about prototyping was a little dry due to the fact that it was almost the exact same as the reading. It was a little bit too similar and it would have been nice to expand upon it more.", 
      0.0
    ], 
    [
      "How do we prototype like this for our project.", 
      3.0
    ], 
    [
      "Implementation of the two android elements.", 
      3.0
    ], 
    [
      "I am still confused about Recycler views. How they are actually implemented and how they actually improve over a standard list.", 
      3.0
    ], 
    [
      "hi-fi. seemed a lot like low fi", 
      3.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Nothing was confusing", 
      0.0
    ], 
    [
      "personas", 
      1.0
    ], 
    [
      "I could have used more clarification concerning differences between the recyclerview and a normal listview.", 
      3.0
    ], 
    [
      "Why hi fi was bad", 
      3.0
    ]
  ], 
  [], 
  [
    [
      "I found the interaction between the workings of the human processors to be interesting", 
      3.0
    ], 
    [
      "the topic of human computer interaction is very Interesting and the reading on it was spectacular.", 
      2.0
    ], 
    [
      "The optical illusions and common biases of people", 
      3.0
    ], 
    [
      "That our reaction time dictates movie frame rate", 
      3.0
    ], 
    [
      "I thought today's class was very interesting. I'm taking a cognitive psychology course and a lot of the things we talked about in class paralleled what we talked about today, so it was interesting to draw comparisons", 
      3.0
    ], 
    [
      "Hyperbolic Discounting", 
      2.0
    ], 
    [
      "I thought being able to use the model human processor to find the fastest a person can type into a keyboard was an interesting example.", 
      3.0
    ], 
    [
      "Seeing the visual illusions was pretty fun.", 
      2.0
    ], 
    [
      "I found the response time for hearing the buzzer for 100m race interesting because try not only factor in going before the buzzer but also making sure your brain had the appropriate time to process the buzzer.", 
      3.0
    ], 
    [
      "I liked the human model recap from the reading.", 
      1.0
    ], 
    [
      "Talking about the required reading", 
      1.0
    ], 
    [
      "I enjoyed today's lecture, quantifying the user's perception. I thought the technical details, such as the speed of human reaction times, were particularly interesting.", 
      3.0
    ], 
    [
      "I found learning about human perceptual processing very interesting.", 
      2.0
    ], 
    [
      "Situation comparisons", 
      2.0
    ], 
    [
      "I found the visual illusions to be the most interesting part of today's class.", 
      2.0
    ], 
    [
      "It's super interesting to see how our perception system is biased. And it's great to know how we process information in such a complexed and integrated way.", 
      3.0
    ], 
    [
      "I found this lecture to be more interesting than the others. I like how we talked about human tendencies. How our mind process things. It is was a change a pace from earlier lectured.", 
      1.0
    ], 
    [
      "Human cognition", 
      1.0
    ], 
    [
      "I was interested in how we can use the human processing model to estimate actual times for how long it takes humans to do certain things.", 
      3.0
    ], 
    [
      "I liked the optical illusions", 
      2.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Everything was fairly clear, I didn't have any problems with it.", 
      0.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "The fact that we are bias", 
      3.0
    ], 
    [
      "Nothing came off as confusing since I had experience with this topic", 
      0.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Nothing was to hard to understand but maybe this would be hard to actually implement in a design", 
      0.0
    ], 
    [
      "Everything was pretty clear except for relating the content to mobile design. I would have liked to see more of a connection between the two.", 
      3.0
    ], 
    [
      "The upper limit on our ability to type was based on the ability to type with one finger, which would increase when more fingers are pressed. Also adding features that autocomplete could get you to 300 word per minute, so a test should be done instead of ruling out the idea that 300 words per minuteis impossible", 
      3.0
    ], 
    [
      "nothing", 
      0.0
    ], 
    [
      "It was extremely difficult to see the slides because of the projector issues.", 
      1.0
    ], 
    [
      "Nothing muddy. I thought it was good that we were shown examples of visual paradoxes, etc.", 
      0.0
    ], 
    [
      "I had a bit of trouble connecting this knowledge to creating better interfaces", 
      2.0
    ], 
    [
      "The times for recognition and remembering", 
      1.0
    ], 
    [
      "nothing about this class was confusing", 
      0.0
    ], 
    [
      "Nothing.", 
      0.0
    ], 
    [
      "Everything seems to make sense", 
      0.0
    ], 
    [
      "nothing", 
      0.0
    ], 
    [
      "It would be interesting to hear more about how we arrive at estimates for processing time at each stage of the human processing model.", 
      3.0
    ], 
    [
      "The screen was hard to read due to projector breaking", 
      1.0
    ]
  ], 
  [], 
  [], 
  [
    [
      "I found it interesting how the field of computer science borrowed such pattern design ideas from the field of architecture and applied them so seamlessly", 
      3.0
    ], 
    [
      "I thought all the design patterns we went over were very interesting, especially the ones involving game design.", 
      3.0
    ], 
    [
      "I thought the discussion on whether using design patterns is bad for creativity was really interesting. On one hand, you're using previous ideas, but on the other, the way you combine them can still be original", 
      3.0
    ], 
    [
      "That expert designers usually do not solve a problem from first principles, the reuse solutions that have work for them and other people before them.", 
      3.0
    ], 
    [
      "I really like our game pattern discussion: consumer producer, power up, high score board. It really gets me thinking the categories of games I play and the philosophy behind these patterns", 
      3.0
    ], 
    [
      "I liked seeing actual code in the beginning of the class. It helped me build up confidence in approaching the project and was interesting to see", 
      3.0
    ], 
    [
      "The code that we can use to control the movements of the ball was very interesting", 
      3.0
    ], 
    [
      "I enjoyed seeing some of the actual design patterns being implemented (despite the outdated pictures) as well as briefly talking about the 3rd project.", 
      3.0
    ], 
    [
      "I found the design patterns for games very interesting because it uses elements of games that I am familiar with such as high score.", 
      3.0
    ], 
    [
      "I was really interested in some of the design concepts used to keep repetitive games interesting, like the producer-consumer idea and the possibility of powerups. I like seeing he reasoning behind things I've interacted with but never thought too much about before.", 
      3.0
    ], 
    [
      "Design patterns", 
      1.0
    ], 
    [
      "Expert Designers reuse solutions for problems.", 
      3.0
    ], 
    [
      "What I found to be the most interesting thing about today's lecture was the explanation of how adding variety and complexity to a game increases increases its fun factor. great lecture. really enjoyed it", 
      3.0
    ], 
    [
      "design principles can be easily contained and made consistent with design patterns", 
      3.0
    ], 
    [
      "The example of how to use the cocos Skelton and breakdown of the assignment", 
      3.0
    ], 
    [
      "Getting some more help with the individual assignment was interesting.", 
      1.0
    ], 
    [
      "cocos2d tutorials", 
      2.0
    ], 
    [
      "I liked seeing c code", 
      2.0
    ], 
    [
      "Cocos2d is quite confusing to me at this point", 
      2.0
    ], 
    [
      "It was difficult wrapping my head around design patterns at first, but it makes a lot more sense now", 
      0.0
    ], 
    [
      "nothing", 
      0.0
    ], 
    [
      "Making he ball bounce. Seemed difficult and it'll be hard for me to get implemented in my assignment.", 
      3.0
    ], 
    [
      "The project tips are still pretty confusing and hard to absorb. But essentially it should all get clearer once I start trying out cocos2d-x", 
      3.0
    ], 
    [
      "Nothing came off as confusing", 
      0.0
    ], 
    [
      "How to launch the scene was confusing", 
      3.0
    ], 
    [
      "I'm still not too sure on how the building architecture relates to mobile design patterns. While there is some of a connection, it would have been nicer to focus more on mobile phones than on buildings.", 
      3.0
    ], 
    [
      "I feel like design patterns can destroy creativity in some way because people resort to recycled content instead of trying to come up with new ideas.", 
      3.0
    ], 
    [
      "I'm still confused about the code syntax for cocos because I have no experience with C++ and therefore I'm concerned about how much trouble I will have with Assignment 3.", 
      1.0
    ], 
    [
      "Depth on design patterns about what we can do to improve user understanding with design patterns", 
      3.0
    ], 
    [
      "Pattern languages are confusing", 
      1.0
    ], 
    [
      "nothing about this lecture was confusing", 
      0.0
    ], 
    [
      "the situations where you would break a pattern", 
      3.0
    ], 
    [
      "How exactly will we use design patterns/language", 
      3.0
    ], 
    [
      "Nothing was confusing.", 
      0.0
    ], 
    [
      "design patterns for games", 
      3.0
    ], 
    [
      "I don't know c++ so a lot of it was new to me and needed a little more explanation", 
      3.0
    ]
  ], 
  [], 
  [
    [
      "The people interaction elements", 
      2.0
    ], 
    [
      "Stanford Prison Experiment", 
      1.0
    ], 
    [
      "I thought it was interesting how important this concept is in mobile design. I never gave it much thought so to see how important it is is interesting. I can see it being useful for mobile design", 
      3.0
    ], 
    [
      "The part I found the most interesting was how Microsoft acquired SwiftKey.", 
      3.0
    ], 
    [
      "Examples for the lecture topic were interesting.", 
      1.0
    ], 
    [
      "Microsoft buying SwiftKey instead of building their own.", 
      3.0
    ], 
    [
      "I found interesting the discussion of ethical considerations.", 
      3.0
    ], 
    [
      "I liked the high level ideas around testing", 
      3.0
    ], 
    [
      "Experiment design was pretty interesting", 
      1.0
    ], 
    [
      "The ethical examinations, the prisoners' test, the facebook fiasco, etc.", 
      3.0
    ], 
    [
      "I liked how concepts from the reading were put in useful context with the course material. I liked the Swiftkey example", 
      1.0
    ], 
    [
      "The in depth talk about experiment factors", 
      3.0
    ], 
    [
      "experiment procedure", 
      2.0
    ], 
    [
      "detailing the scientific method and how it would be used in real-life scenarios was helpful.", 
      3.0
    ], 
    [
      "It's interesting to know the feelings of participants and look closely to how to conduct a good experiment", 
      3.0
    ], 
    [
      "The swift key example helped me understand variables better", 
      3.0
    ], 
    [
      "How to make participants feel welcome.", 
      3.0
    ], 
    [
      "Today was the midterm. Professor NEEDS to do a better job at expressing what will be on the test. General consensus seems like people didn't even know what to study for.", 
      1.0
    ], 
    [
      "common pitfalls when designing a study", 
      3.0
    ], 
    [
      "the design necessary in making a study", 
      3.0
    ], 
    [
      "I thought some of the midterm questions were quite unfair, such as how to calculate frame rate", 
      1.0
    ], 
    [
      "designing controlled experiments using independent, dependant. control and random variables were interesting for the testing", 
      1.0
    ], 
    [
      "I found the discussion about the prison experiment interesting because it shows how an experiment can push the bounds of ethics.", 
      1.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Nothing came as confusing", 
      0.0
    ], 
    [
      "There was no confusion.", 
      0.0
    ], 
    [
      "Nothing was confusing.", 
      0.0
    ], 
    [
      "The thing I am mostly confused about is how those outrageous experiments from Harvard and Stanford ever happened!!!!!!!!! !", 
      3.0
    ], 
    [
      "I could have benefitted from more specific examples of using statistical measures.", 
      3.0
    ], 
    [
      "I don't care for the specifics of testing", 
      3.0
    ], 
    [
      "The lucid hypothesis aspect of it", 
      3.0
    ], 
    [
      "Nothing muddy. The quantitative reasoning stuff is always challenging: dependent v. independent variables, how to test, etc.", 
      0.0
    ], 
    [
      "The lecture was totally clear", 
      0.0
    ], 
    [
      "Why we needed to know all the statistics information", 
      3.0
    ], 
    [
      "nothing", 
      0.0
    ], 
    [
      "Nothing was confusing today.", 
      0.0
    ], 
    [
      "All good", 
      0.0
    ], 
    [
      "I had trouble understanding within subject design", 
      2.0
    ], 
    [
      "Experiment design", 
      1.0
    ], 
    [
      "Test materiel", 
      2.0
    ], 
    [
      "nothing", 
      0.0
    ], 
    [
      "how any of us would carry out a study", 
      1.0
    ], 
    [
      "There was also not a word bank as promised, it was a lot of memorization.", 
      1.0
    ], 
    [
      "the way it was implemented seemed very much like tdd that I learned in ta", 
      1.0
    ], 
    [
      "I was confused how some of the ethical guidelines didn't apply to our experiments for the projects since we still have a responsibility to follow ethical practices.", 
      3.0
    ]
  ], 
  [], 
  [], 
  [], 
  [], 
  [], 
  [], 
  [], 
  [], 
  [], 
  []
]