[
  [], 
  [
    [
      "", 
      0.0
    ], 
    [
      "I was a little lost at the beginning of the lecture b/c it had been a while since I've used common chemistry terms (valance, cation, anion …) how do you know when something is covalent + van der wall versus just van der wall", 
      3.0
    ], 
    [
      "The muddiest point I would have to say would have been the first activity. At first I wasn't sure what was supposed to be done and I really had no idea how to complete the activity", 
      1.0
    ], 
    [
      "being able to distinguish the types of bonds present and properties expected solely based on the name of the material", 
      3.0
    ], 
    [
      "The electrical and thermal properties section because it will not be covered until tomorrow's section", 
      2.0
    ], 
    [
      "The worksheets are hard to read, and I think that there needs to be more explanation when talking about bonding and what type of materials have what type of bonding", 
      2.0
    ], 
    [
      "The printouts were too small to be read", 
      1.0
    ], 
    [
      "The bonding activity needed to be printed better", 
      1.0
    ], 
    [
      "Conduction band vs. valence band", 
      3.0
    ], 
    [
      "N/ A ( 0% confusion)", 
      0.0
    ], 
    [
      "I understood everything, but I think many were confused by band gap", 
      0.0
    ], 
    [
      "I'm a little confused as to what procedure different bonds give materials", 
      2.0
    ], 
    [
      "The gap in the conductors that looks like this : CB/GAP/ VB", 
      3.0
    ], 
    [
      "I found the processing of materials to be somewhat confusing", 
      2.0
    ], 
    [
      "The concepts of bonds when talking about conductivity", 
      2.0
    ], 
    [
      "The information about conductors, semi-conductors and insulators was confusing for me. I am unclear about the band gap and electrons jumping. I have no prior knowledge on this subject", 
      3.0
    ], 
    [
      "Figuring out what bonding a material has", 
      2.0
    ], 
    [
      "He kind of read off his slides the whole time", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The section about gaps between energy levels", 
      2.0
    ], 
    [
      "The printing needs to better so it can be easier to read", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The first activity was hard to read", 
      1.0
    ], 
    [
      "Difference between covalent and ionic", 
      3.0
    ], 
    [
      "Van der Waals bonding / forces", 
      2.0
    ], 
    [
      "Nomenclature and processing methods were unclear", 
      2.0
    ], 
    [
      "How to tell if a structure has 2 types of bonding", 
      3.0
    ], 
    [
      "Feels like an overviewing of things previously learned so it's not clear what kinds of questions you'll be asking to test comprehension. ( unless it's like the activities we did)", 
      1.0
    ], 
    [
      "Needed more differentiation between ionic & covalent specifics & examples", 
      3.0
    ], 
    [
      "Secondary bonding, dipoles within molecules", 
      3.0
    ], 
    [
      "The pictures on the activities were difficult to read", 
      1.0
    ], 
    [
      "I didn't find anything confusing", 
      0.0
    ], 
    [
      "The worksheet was difficult to read. Bonding on 2nd activity was confusing", 
      1.0
    ], 
    [
      "Having difficulty identifying the bonding and processing for the activity", 
      2.0
    ], 
    [
      "I didn't understand the thermal properties very well, especially because I couldn't read the labels on the graphs clearly. Thermal expansion + elastic modulus were totally new concepts for me", 
      3.0
    ], 
    [
      "The reasoning behind why it does what it does", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I just need to refresh my chemistry", 
      1.0
    ], 
    [
      "How Kevlar works", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I am still not entirely sure the electrical properties on the worksheet", 
      2.0
    ], 
    [
      "Identifying bonding", 
      2.0
    ], 
    [
      "Got it all", 
      0.0
    ], 
    [
      "There really wasn't anything that I felt that was confusing during this class at all", 
      0.0
    ], 
    [
      "Van der waal bonding", 
      2.0
    ], 
    [
      "On the \"concept map\", the text was too grainy to make out", 
      1.0
    ], 
    [
      "Nothing was confusing nor needed more detail", 
      0.0
    ], 
    [
      "Van der waals", 
      2.0
    ], 
    [
      "Nothing", 
      0.0
    ]
  ], 
  [
    [
      "", 
      0.0
    ], 
    [
      "nothing", 
      0.0
    ], 
    [
      "Graphs of attraction/repulsive & interatomic separation", 
      3.0
    ], 
    [
      "Most of the lecture was muddy. I tried to follow along but I couldn't grasp the concepts. Plus it's hard to see what's written on the white board when the projector shines on it", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Energy vs. distance between atoms graph and what it tells us", 
      3.0
    ], 
    [
      "We jumped right into several slides with complicated graphs and undefined variables. I couldn't understand the trends", 
      1.0
    ], 
    [
      "I think graphs and equations are hard to understand because I'm unfamiliar with the terms and equations", 
      1.0
    ], 
    [
      "size of print and colors are hard to read on printout", 
      1.0
    ], 
    [
      "Equations with bond strength and Hooke's law", 
      3.0
    ], 
    [
      "4: AXES on coefficient of thermal expansion graph. \n5:Hooke's law\n-You need a laser pointer,15% of the class can't see what you are pointing at", 
      3.0
    ], 
    [
      "The activity ( Part III)", 
      1.0
    ], 
    [
      "I didn't have any trouble with anything", 
      0.0
    ], 
    [
      "Stress + Strain", 
      2.0
    ], 
    [
      "What happens to atomic structure when heated", 
      3.0
    ], 
    [
      "I didn't fully understand the concept of thermal expansion", 
      3.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "The graphs of attraction and repulsion were confusing to me", 
      3.0
    ], 
    [
      "Property related to bond strength", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Elastic modulus", 
      1.0
    ], 
    [
      "Graphs are too small to look at specific detail", 
      1.0
    ], 
    [
      "van der waals", 
      1.0
    ], 
    [
      "Equations with stress", 
      2.0
    ], 
    [
      "Elastic modulus", 
      1.0
    ], 
    [
      "The activity was difficult to comprehend as the text fuzzing and difficult to read. The pictures are impossible to understand It's too small", 
      1.0
    ], 
    [
      "I was unsure of how to determine the α values but a group member explained it more clearly.", 
      3.0
    ], 
    [
      "How to determine which metal has higher coefficient of thermal expansion", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The repulsive/ attraction charts", 
      2.0
    ], 
    [
      "The coefficient of thermal expansion relationship to bond strength", 
      3.0
    ], 
    [
      "Elastic modulus", 
      1.0
    ], 
    [
      "I found a little confusing properties related to bond strength", 
      2.0
    ], 
    [
      ".The coefficient thermal expansion\n.The worksheet we did in class", 
      3.0
    ], 
    [
      "What is the coeff of thermal expansion? The graphs were muddy but we better understood with the activity", 
      3.0
    ], 
    [
      "Graphs of attractive  + repulsive forces", 
      2.0
    ], 
    [
      "The different graphs that look the same", 
      1.0
    ], 
    [
      "I struggled a little bit the elastic modulus", 
      1.0
    ], 
    [
      "Just thought the lecture helps out more than activities", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I didn't understand the attractive and repulsive force graphs from the third slide", 
      2.0
    ], 
    [
      "The working definition of elasticity is not very clear. I think I'm imagining resilience instead", 
      3.0
    ], 
    [
      "I would like to have learned more about how to calculate the bond strength analytically and how that calculation relates to the graph", 
      3.0
    ], 
    [
      "How to determine the answers to part III, in the activity", 
      3.0
    ], 
    [
      "Part III on worksheet in class, comparing metals. I was confused about why each metal was selected", 
      3.0
    ], 
    [
      "Not the least bit confusing. All information was understood as needed for the class", 
      0.0
    ], 
    [
      "Nothing confusing", 
      0.0
    ], 
    [
      "Nothing really. This class could perhaps move at a much faster rate", 
      0.0
    ]
  ], 
  [
    [
      "Gold activity", 
      1.0
    ], 
    [
      "I was a little confused on the exact difference between different crystal systems (monoclinic, etc)", 
      3.0
    ], 
    [
      "Unit cell transformation pictures in 1st activity, 2nd activity (characteristics) # of atomic radii along touch directions with in unice cell", 
      3.0
    ], 
    [
      "Just need a little more explanation on how to find the values we learned", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Knowing which structures produce which material properties", 
      2.0
    ], 
    [
      "The math involved with finding atomic packing factor, and the relationship between a and r", 
      3.0
    ], 
    [
      "I thought the unit cell activities were confusing because not everyitem was well explained", 
      2.0
    ], 
    [
      "The charts involving unit cell dimensions & measurements", 
      2.0
    ], 
    [
      "The activities", 
      2.0
    ], 
    [
      "Too many abbreviations in the slides", 
      1.0
    ], 
    [
      "Calculation of atomic Radaii along edge", 
      3.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Why structure changes happened", 
      2.0
    ], 
    [
      "The features of FCC: length FD and BD", 
      3.0
    ], 
    [
      "Atoms touching along a direction?\nHidden … ????? 5", 
      1.0
    ], 
    [
      "I'm still confused on the processing method of materials (like in the activity we did today)", 
      2.0
    ], 
    [
      "APF", 
      1.0
    ], 
    [
      "Elephant stampede in a rainstorm", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Why certain metals have BCC, FCC or HCP structures? The whole lecture was very confusing", 
      3.0
    ], 
    [
      "Going over the class work", 
      1.0
    ], 
    [
      "Unit cells atomic factor + length FD + length BD", 
      3.0
    ], 
    [
      "Components of unit cells", 
      2.0
    ], 
    [
      "Structure characteristics on --> teacher … waaay too fast", 
      1.0
    ], 
    [
      "FCC, BCC, etc", 
      2.0
    ], 
    [
      "APF/ lattice constant was less clear and brushed over", 
      2.0
    ], 
    [
      "The lattice crystal", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The material in the activities. I could not answer them", 
      1.0
    ], 
    [
      "The details of the properties of the crystalline", 
      3.0
    ], 
    [
      "Whethere we describe unit cell lengths in terms of a or c", 
      3.0
    ], 
    [
      "Everything was clear", 
      0.0
    ], 
    [
      "I have a really hard time figuring out the processing on our activities.", 
      1.0
    ], 
    [
      "Stacking sequence", 
      2.0
    ], 
    [
      "Hexagonal close-packed structures (covered very quickly)", 
      2.0
    ], 
    [
      "Made some kind of sense", 
      0.0
    ], 
    [
      "Atomic packing factor", 
      1.0
    ], 
    [
      "Need to review crystall properties", 
      2.0
    ], 
    [
      "Caculating structure characteristics", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The processing on the first class activity were very confusing", 
      1.0
    ], 
    [
      "How unit cell affects proessing", 
      2.0
    ], 
    [
      "The atomic packing factor idea was very confusing and needed more explanation", 
      2.0
    ], 
    [
      "Calculationg APF & coordination #, etc", 
      3.0
    ], 
    [
      "Directional notation for atoms touching (e.g. <1 1 0>", 
      3.0
    ], 
    [
      "Not confusing", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "equations on cubic ?", 
      1.0
    ], 
    [
      "how to determine close-packing", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "There were a few points (such as unit cell direction, how they are indexed) that I wasn't sure on. It got better as we went over it in the activity though", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I understood everything but my group had problems with their coordinate systems. Maybe the similarities between this and vectors (unit vectors) could be emphasized", 
      0.0
    ], 
    [
      "I think that trying to find the directions is confusing because I do not understand how to move the origin then find the direction", 
      3.0
    ], 
    [
      "Atomic Packing No.", 
      2.0
    ], 
    [
      "Explanation of different unit cells", 
      2.0
    ], 
    [
      "Unit cell calculations related to a, R, etc.", 
      2.0
    ], 
    [
      "Unit cell drawing activity, 5th unit cell", 
      2.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Where to move the origin", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Unit cell volume", 
      1.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Figuring out new origin", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How to determine close packing? Is it just if it's BCC or FCC?", 
      3.0
    ], 
    [
      "The indexing strategies are still confusing when making new origins", 
      3.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "A little about indexing was confused", 
      2.0
    ], 
    [
      "Understood everything today!!", 
      0.0
    ], 
    [
      "Direction within the unit cell", 
      2.0
    ], 
    [
      "How to identify if a unit cell is CP by its vector?", 
      3.0
    ], 
    [
      "How to manipulate the cells to keep the vectors inside the cube", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Atomic Packing Factor", 
      1.0
    ], 
    [
      "Whether to use max indices value of 1, or no fractions", 
      3.0
    ], 
    [
      "Which index correspond to which crystal structure", 
      3.0
    ], 
    [
      "I found today's topic confusing however with the aid of the activities I understand everything now", 
      0.0
    ], 
    [
      "Unit cell directions- how they indexed- confused on how to find new origin", 
      3.0
    ], 
    [
      "Still confused on solving FCC, BCC, etc.\nCharacteristics ( i.e. Cube edge, a₀, … )", 
      3.0
    ], 
    [
      "Why don't (like the coordinates of the origin) have round brackets around them? I understand that the vector needs square brackets but I thought points should be written (0,0,0)", 
      3.0
    ], 
    [
      "Their OK, but the review in the beginning were still blumy", 
      1.0
    ], 
    [
      "Atom packing", 
      1.0
    ], 
    [
      "The O from different point", 
      1.0
    ], 
    [
      "Last activity", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I still don't understand the [1, 1, 1] or [0, 1, 0] and all of the x, y & z axes, please explain!", 
      3.0
    ], 
    [
      "What properties ?", 
      1.0
    ], 
    [
      "Although interesting I think the calculation of the unit cell directions (drawing and indexing) needed to be explained a little more", 
      3.0
    ], 
    [
      "Nothing today :)", 
      0.0
    ], 
    [
      "Diagrams were incorrect ( showed [1‾  1 1]instead of [1 1 0] )", 
      2.0
    ], 
    [
      "Close packing for indices ex: [0 1/2 1/2]", 
      3.0
    ], 
    [
      "Close Packing", 
      2.0
    ], 
    [
      "Nothing", 
      0.0
    ]
  ], 
  [
    [
      "Planes", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Very little was muddy but once we started doing activities I understood it", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How these planes and miller indices relate to real world material?", 
      3.0
    ], 
    [
      "As you said, we should have used the physical models to help describe slices of planes", 
      3.0
    ], 
    [
      "I'm still confused about packing density and learning about the planar density, I'm not sure about how to do the calculations", 
      3.0
    ], 
    [
      "New origins, do they need to be in corners or can they be on edges?", 
      3.0
    ], 
    [
      "Planer density of atoms", 
      1.0
    ], 
    [
      "Packing Density", 
      1.0
    ], 
    [
      "Drawing the intersection of atoms with the unit cell planes", 
      3.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "When ? the planes drawing how many atoms were on the face of the plane", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Determining new origin", 
      2.0
    ], 
    [
      "Family units", 
      1.0
    ], 
    [
      "The ending stuff about atoms on the plane was rushed and confusing", 
      2.0
    ], 
    [
      "How this is relevant to bonding", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Determining indices of given planes was confusing and drawing atoms on planes", 
      3.0
    ], 
    [
      "Slicing the unit cells and seeing where the atomes are", 
      3.0
    ], 
    [
      "Packing Density", 
      1.0
    ], 
    [
      "PD of unit cell", 
      1.0
    ], 
    [
      "Indices", 
      1.0
    ], 
    [
      "family vector notation ex. <1 0 0>", 
      2.0
    ], 
    [
      "How does the Miller indices effect strength", 
      3.0
    ], 
    [
      "It was overall good", 
      0.0
    ], 
    [
      "Why we were talking about packing densities along non-touching planes. Is this where they break?", 
      3.0
    ], 
    [
      "Inverting plane indices, Visualizing planes through atoms, Areas of atoms and planes", 
      3.0
    ], 
    [
      "Counting atoms per plane", 
      2.0
    ], 
    [
      "How to determine that unit cell area", 
      2.0
    ], 
    [
      "Everything today was clear", 
      0.0
    ], 
    [
      "Planar density of atoms", 
      1.0
    ], 
    [
      "Packing Density and drawing pics on unit cell worksheet", 
      2.0
    ], 
    [
      "Not much, Can be hard to visualize this stuff but practice helps", 
      0.0
    ], 
    [
      "The atom fraction was confusing", 
      2.0
    ], 
    [
      "Packing Density", 
      1.0
    ], 
    [
      "Clear as mud", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I'm still not entirely sure about packing factor", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Drawing the planes and figuring out how the planes touch is very confusing and hard to conceptualize", 
      3.0
    ], 
    [
      "Triangular unit cell atom area & packing Density", 
      2.0
    ], 
    [
      "Difference between types of brackets", 
      1.0
    ], 
    [
      "Nothing was confusing nor needed clarity", 
      0.0
    ], 
    [
      "Brackets ands Parenthesis", 
      1.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "", 
      0.0
    ], 
    [
      "Types of defects and difference in effects", 
      2.0
    ], 
    [
      "Last activity: processing method", 
      1.0
    ], 
    [
      "Explanation of 0-D (Point), 1-D (line), 2-D (Plane). Is this dealing with crystalline structures and plotting planes?", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "New vocabulary and terms. I'm absorbing ... as we go through", 
      1.0
    ], 
    [
      "The phase diagrams demonstrating solubility were a little confusing because I have only seen phase diagrams with one substance in the past", 
      3.0
    ], 
    [
      "I'm still confused about the dislocations because they are very hard for me to picture", 
      3.0
    ], 
    [
      "Differentiating between deformations", 
      3.0
    ], 
    [
      "Types of imperfections. How to tell difference?", 
      3.0
    ], 
    [
      "Relating processing method to type of defect", 
      3.0
    ], 
    [
      "Naming different imperfections", 
      3.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "I was pretty confused by the grain boundary #", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I found the hume-Bothery Rules for solubility somewhat confusing", 
      2.0
    ], 
    [
      "Screw dislocation", 
      1.0
    ], 
    [
      "The most confusing point for me was the activity on effects of defects on materials properties", 
      1.0
    ], 
    [
      "How the defects give what properties", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How to determine grain boundaries", 
      2.0
    ], 
    [
      "How to identify which imperfection is which", 
      2.0
    ], 
    [
      "Grain boundaries", 
      1.0
    ], 
    [
      "Specific types of defects", 
      2.0
    ], 
    [
      "Edge dislocations", 
      1.0
    ], 
    [
      "The difference in structures of impurities was a little difficult to understand", 
      2.0
    ], 
    [
      "Matching an imperfection with it's mechanism", 
      2.0
    ], 
    [
      "How screw dislocation affects materials as a whole", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Defect terminology", 
      1.0
    ], 
    [
      "The difference in 1-D defects", 
      2.0
    ], 
    [
      "How the phase diagram correlates to atomic radius", 
      3.0
    ], 
    [
      "I found that characterizing imperfections a bit confusing", 
      2.0
    ], 
    [
      "Characterizing grain structure", 
      2.0
    ], 
    [
      "Still confused on when to use [ ] and ( ) families of planes\nTypes of directions in a plane\nEdge/ screw dislocations \nGrain boundaries", 
      2.0
    ], 
    [
      "Where exactly is the dislocation line in screw dislocation? It looks more like a plane", 
      3.0
    ], 
    [
      "All the vocabulary & the solubility was really confusing, the smaller per?, the more solubility?", 
      3.0
    ], 
    [
      "How dislocations are formed", 
      3.0
    ], 
    [
      "Just need to associate deformations with properties", 
      2.0
    ], 
    [
      "Grain defects", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The activity was confusing", 
      1.0
    ], 
    [
      "Phase diagrams", 
      1.0
    ], 
    [
      "The conversion calculations for weight %  or mole % was just a bit unclear", 
      2.0
    ], 
    [
      "Identifying defects / materials properties", 
      2.0
    ], 
    [
      "Visualizing screw dislocation", 
      2.0
    ], 
    [
      "Nothing was unclear", 
      0.0
    ], 
    [
      "1-D deformation", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "Stress corrosion fractures", 
      2.0
    ], 
    [
      "Finding yield strength and % el from graph", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Very little was confusing but if I must say, the most confusing thing was the graph on the tensile test concept map (Need more explanation of what everything means)", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "No problems except for the specific equations used to determine properties from the stress-strain graph", 
      3.0
    ], 
    [
      "I thought the stress-strain curves are confusing because I am still not sure how to calculate some of the stress", 
      3.0
    ], 
    [
      "Stress/strain graph calculations", 
      2.0
    ], 
    [
      "Not much", 
      0.0
    ], 
    [
      "• Relating 110 direction to close packed plane of atoms \n• Aₒ for % RA", 
      3.0
    ], 
    [
      "Knowing what the physical meaning of the \n% el", 
      3.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Yield strength", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Ductility: % elongation or % reduction area", 
      3.0
    ], 
    [
      "Screw dislocation", 
      1.0
    ], 
    [
      "The stress vs. strain graph is still a little confusing", 
      2.0
    ], 
    [
      "Ductility: % elongation or % reduction area", 
      3.0
    ], 
    [
      "Is ductility as % el only measured at fracture? (slid 20) if so why?", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Is the yield strength the vertex?", 
      3.0
    ], 
    [
      "Trying to figure of YS %", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Some of the terms were confusing", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I found the fact that plastic deformation, although true, makes it stronger hard to believe", 
      3.0
    ], 
    [
      "Model for dislocation motion", 
      2.0
    ], 
    [
      "Nothing was really muddy today", 
      0.0
    ], 
    [
      "How a material can be both more brittle and stronger via processing", 
      3.0
    ], 
    [
      "% RA", 
      2.0
    ], 
    [
      "Why would vacancy increase material strength", 
      3.0
    ], 
    [
      "Where along a crystal structure is the elastic modulus highest?", 
      3.0
    ], 
    [
      "I found the graphs a bit confusing", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "% el - % RA", 
      2.0
    ], 
    [
      "Ran out of time on last activity\nDuctility was confusing", 
      1.0
    ], 
    [
      "The units for E Elastic Modulus", 
      2.0
    ], 
    [
      "Elastic deformation", 
      1.0
    ], 
    [
      "Terminology", 
      1.0
    ], 
    [
      "What is stress", 
      1.0
    ], 
    [
      "Toughness & stiffness, Fraction total strain", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Example calculations would have been cool", 
      1.0
    ], 
    [
      "The % el and % RA topics were the muddiest and I feel very confused about these topics", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How to calculate % elongation", 
      2.0
    ], 
    [
      "One topic that could have used more clarification was how the edge dislocation moves in a bent piece", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "% RA", 
      2.0
    ]
  ], 
  [
    [
      "Elongation HW, Failure types", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "there's quite a bit of stuff we learned today but not too much was confusing. Maybe just go over terminology again for remembrance", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "influence of temperature on impact energy", 
      2.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "some of the failure type are hard to picture", 
      1.0
    ], 
    [
      "Griffith Crock formula", 
      2.0
    ], 
    [
      "The calculations and telling the difference between each graph", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Flaws are stress concentrations", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Fracture toughness testing", 
      2.0
    ], 
    [
      "failure types", 
      1.0
    ], 
    [
      "All of the equations for the concepts: stress, strain, and failure", 
      2.0
    ], 
    [
      "How a failure can be read in a graph or a event of failure and how a ductile or brittle fracture is relevant", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "More detail on concepts. Lecture was rushed", 
      1.0
    ], 
    [
      "σm= 2σ₀ (q/et)^1/2=K+σ₀", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Determining what graphs are describing", 
      2.0
    ], 
    [
      "Griffith Crock formula", 
      2.0
    ], 
    [
      "I had a difficult time understanding the graphs on the activity", 
      2.0
    ], 
    [
      "How cracks can impede fracture", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "On slide #4, are the necking & fracture images a series of steps on individual kind of fracture types ( ? 1-5)", 
      3.0
    ], 
    [
      "Too many graphs to keep track of", 
      1.0
    ], 
    [
      "Does initiation in failures take an ... amount of time or just label the beginning of propagation?", 
      3.0
    ], 
    [
      "Identifying the graphs were a bit difficult", 
      2.0
    ], 
    [
      "I found reading the graphs of stress corrosion and others similar to it confusing", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Impact loading could use more in depth explanation", 
      2.0
    ], 
    [
      "Mechanism/ microstructures of failures (usually grain boundaries?)", 
      3.0
    ], 
    [
      "Do the graphs have specific calculations?", 
      2.0
    ], 
    [
      "How to improve fatigue life", 
      3.0
    ], 
    [
      "Need to absorb the material more about fractures", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Relation between crystal structure & failure types", 
      3.0
    ], 
    [
      "The high Temperature creep failure was pretty muddy for me and was hard to understand", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "how to read some graphs", 
      1.0
    ], 
    [
      "Nothing seemed unclear", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "", 
      0.0
    ], 
    [
      "? 6 problem", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Diffusion & activation energy", 
      2.0
    ], 
    [
      "Went very fast today so I'm not sure I understand the concept", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The types covered in the activity \"Bulk Diffusion\" \"Grain Boundary Diffusion\" etc.", 
      2.0
    ], 
    [
      "I don't understand all of the diffusion types And their importance", 
      3.0
    ], 
    [
      "How the new formulas apply to what we learned", 
      2.0
    ], 
    [
      "Different types of diffusion (How to tell)", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Everything, too brief due to review, o well I'll just read", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Mechanical Property calculations", 
      2.0
    ], 
    [
      "Diffusion", 
      1.0
    ], 
    [
      "Do you really read these? How do I know?\nHow much does the woodpecker elongate? Include all assumptions", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Fick's 2nd law", 
      2.0
    ], 
    [
      "How to find mechanical properties", 
      3.0
    ], 
    [
      "I would like to spend more time for the review", 
      1.0
    ], 
    [
      "Not finishing the review with any understanding", 
      1.0
    ], 
    [
      "Fick's laws", 
      2.0
    ], 
    [
      "How diffusion can occur in metals", 
      3.0
    ], 
    [
      "lot of material that wasn't explored", 
      1.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Types of diffusion", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Properties on practices", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Types of diffusion and how to distinguish them", 
      3.0
    ], 
    [
      "I found what diffusion actually is a bit confusing", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Factors affecting activation energy", 
      3.0
    ], 
    [
      "Activation energy graph and what the bump represent", 
      3.0
    ], 
    [
      "Test review problem III mechanical properties graphs", 
      3.0
    ], 
    [
      "Just need to go over ?", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Material and application & property", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The equations used to calculate diffusion (Fick's laws)", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Fick's laws- They looked complicated, but were ? Over", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "Math; Thermal conductions change", 
      2.0
    ], 
    [
      "Differences in processing, Rolling, Drawing, etc…", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Not much was muddy today. Maybe go over everything again as a refresher", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The graphs about cold working", 
      2.0
    ], 
    [
      "Which process strengthens materials more effectively? Cold working or grain size?", 
      3.0
    ], 
    [
      "I don't know how to distinguish between the different strengthening mechanisms", 
      3.0
    ], 
    [
      "Differentiating between extrusion & drawing and when to use each", 
      3.0
    ], 
    [
      "Why the strengthening occurs based on cold working or hot working", 
      3.0
    ], 
    [
      "Some of the cold work annealing effects activity", 
      3.0
    ], 
    [
      "Deformation processing activity, perhaps a video to help conceptualize", 
      2.0
    ], 
    [
      "Recrystallization. I'm confused by the process\nElectric/ thermal conductivity in last activity", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Grain size reduction", 
      1.0
    ], 
    [
      "Extrusion", 
      1.0
    ], 
    [
      "The processes of drawing forging, extrusion, and rolling. What are they exactly?", 
      2.0
    ], 
    [
      "How dislocations + Grains are related to annealing and cold work", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Annealing concepts with grains & dislocations", 
      3.0
    ], 
    [
      "Figuring the properties of metals after grain growth", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Trying to decipher the graphs + pictures", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Grain growth calculation", 
      2.0
    ], 
    [
      "Why does lead allow for hot working at such a low temp?", 
      3.0
    ], 
    [
      "Thermal Conductivity change", 
      2.0
    ], 
    [
      "_hall-Petch equation\n_ Thermal/ Elec. Conductivity changes", 
      2.0
    ], 
    [
      "Nothing was really muddy, however, I did have a side thought about grains and recrystallization. Do galvanized metal and grain relate somehow? The shine galvanized steel reminds me of the grain images", 
      3.0
    ], 
    [
      "How to read graphs", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Why are pipes made by drawing? Not extrusion?", 
      3.0
    ], 
    [
      "Electrical + thermal conductivity effects of working metal", 
      3.0
    ], 
    [
      "Where is A₀ & Af taken from? Are they given?", 
      3.0
    ], 
    [
      "Dislocation density changes/ Conductivity", 
      2.0
    ], 
    [
      "Make sense", 
      0.0
    ], 
    [
      "What is cold working and why does it increase Ys and Ts but not ductility", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Annealing- more description of the process", 
      1.0
    ], 
    [
      "The strengthening methods and deformation process was a little bit muddy when it come to relating different types to real world products", 
      3.0
    ], 
    [
      "Final activity on effects of cold work, annealing, etc…", 
      1.0
    ], 
    [
      "What is the effect on conductivity from dislocations?", 
      3.0
    ], 
    [
      "How the electrical + thermal conductivity increases or decreases based on the dislocation density was a bit unclear", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Why does ductility reduce when a material is cold worked", 
      3.0
    ]
  ], 
  [
    [
      "Phase diagram", 
      1.0
    ], 
    [
      "What α & β exactly are", 
      1.0
    ], 
    [
      "Labling phase regions of phase diagram", 
      2.0
    ], 
    [
      "I'm still not sure what saturated, unsaturated and super saturated mean", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Labeling 2 phase regions of a phase diagram", 
      2.0
    ], 
    [
      "The naming system for the 2 phase regions. Also what determines what Greek letter denotes the regions", 
      3.0
    ], 
    [
      "Interpreting the eutectic graphs is super confusing. I understand the Pb-Sn one, but the Hf-V graph was extremely complicated and I did not understand it", 
      3.0
    ], 
    [
      "Activity-Labeling 2 phase regions of a phase diagram", 
      2.0
    ], 
    [
      "Labeling 2 phase regions", 
      2.0
    ], 
    [
      "I can't see the board sometimes. Step back a bit more often", 
      1.0
    ], 
    [
      "Phase diagrams", 
      1.0
    ], 
    [
      "Nothing was very bad, it all made sense/ was logical, other people seemed a little lost though", 
      0.0
    ], 
    [
      "Today's class was really confusing almost the whole time. I wanted more explanation for a lot of stuff", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Graph % sugar in soln. at fixed comp.", 
      2.0
    ], 
    [
      "Solubility names", 
      1.0
    ], 
    [
      "The graphs of solubility temperature. I don't know when to follow the bold arrow vs. when to follow the curve", 
      3.0
    ], 
    [
      "Solubility and the graphs", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Knowing correct phase on phase diagrams", 
      2.0
    ], 
    [
      "Labeling 2 phase regions of a phase diagram", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Multi phase diagram labeling", 
      2.0
    ], 
    [
      "Labeling 2 phase regions of a phase diagram", 
      2.0
    ], 
    [
      "labeling phase diagrams", 
      1.0
    ], 
    [
      "2nd activity, 2 phase regions of a phase diagram", 
      2.0
    ], 
    [
      "The phase diagrams and how to interpret the graphs", 
      2.0
    ], 
    [
      "Why is the α+β regions ( G on phase diagram activity) called the 2-phase region if both component are solid", 
      2.0
    ], 
    [
      "The interpretation of the graphs", 
      1.0
    ], 
    [
      "All the different regions on the Pb-Sn diagram", 
      1.0
    ], 
    [
      "Labeling 2 phase regions of a phase diagram", 
      2.0
    ], 
    [
      "I do not understand exactly what α+β means", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How it goes from one phase to the next and what that means. Unsure about super saturation now.", 
      2.0
    ], 
    [
      "What are the α, β, α+β, α+L and β+L regions actually like? I don't have a good picture or understanding of what they are or how they behave", 
      3.0
    ], 
    [
      "The meaning of the solubility limit", 
      3.0
    ], 
    [
      "Labeling phase diagram using Greek letter", 
      2.0
    ], 
    [
      "Just need to go over the α, β stuff", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Phase diagram and Ts", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "What the heek is α?", 
      1.0
    ], 
    [
      "Labeling 2 phase regions of a phase diagram was very muddy and went by way too quickly, needs more explanation", 
      2.0
    ], 
    [
      "The graphs", 
      1.0
    ], 
    [
      "The Ht vs. V phase diagram, I had no idea what was going on, thanks to the multitude of intersecting lines regions", 
      2.0
    ], 
    [
      "What exactly is α+β, α+L and β+L", 
      2.0
    ], 
    [
      "Pb-Sn phase diagram", 
      2.0
    ], 
    [
      "Could you explain why you want to know F M? I would guess it has something to do with wanting F to succeed since there aren't many engineers but I'm not sure how it relates to metacogging", 
      3.0
    ]
  ], 
  [
    [
      "Got it", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Not much", 
      0.0
    ], 
    [
      "At first 2 had no ? What was going on but once we did on activity, my peers helped me understand the material and I think I know the material how..", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Microstructure composition", 
      1.0
    ], 
    [
      "I saw that a lot of people had problems interpreting the diagrams, but I didn't have any problems", 
      0.0
    ], 
    [
      "I don't think there was anything too confusing in today's class", 
      0.0
    ], 
    [
      "Differentiating the 1-2-1-2 phases on a large phase diagram", 
      3.0
    ], 
    [
      "Phase fractions still… microstructure", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Not much confusion today, well explained", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "α + β, those diagrams are confusing", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Microstructure", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Formation of plates of α & β", 
      2.0
    ], 
    [
      "Figuring out phase fractions", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The elements kicking each other out of different phases", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I think we moved a little quick in the summary of eutectic microstructures", 
      1.0
    ], 
    [
      "How is the Eutectic pt reached?", 
      3.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "We should have more eutectic activities involving calculations", 
      1.0
    ], 
    [
      "Sometimes get phase fractions mixed up", 
      1.0
    ], 
    [
      "What happens when a liquid cools down at the eutectic composition", 
      3.0
    ], 
    [
      "I do not know why tensile strength is at the top (Slide 14)", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Phase & diagram meanings", 
      1.0
    ], 
    [
      "Pro / Pre/ Hypo / Hyper prefixes_ What do they mean?", 
      1.0
    ], 
    [
      "Will the phase diagrams have different compositions & if they do, what will they look like? Will it only be α + β?", 
      3.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Copm.as material cools from L to α+L to α+β", 
      3.0
    ], 
    [
      "Eutectic microstructure", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How do we determine eutectic points from the diagram?", 
      3.0
    ], 
    [
      "Finding the eutectic points on very complicated phase diagrams was fairly muddy", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Difference between chemical composition and phase fraction", 
      3.0
    ], 
    [
      "Why do some α + β lines terminate before they reach the bottom of the table?", 
      3.0
    ], 
    [
      "The Eutectic microstructure & what does a microstructure look like at room temperature", 
      3.0
    ], 
    [
      "It was all good today", 
      0.0
    ]
  ], 
  [
    [
      "Microstructure diagram", 
      2.0
    ], 
    [
      "Telling the difference between microstructures in pictures", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Not really sure what the difference is between the hypo, hyper eutectoid, eutectoid other than that they describe different part on a graph", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Do alloys of steel change the phase diagram?", 
      3.0
    ], 
    [
      "I still don't quite understand how to classify the steel and find it on a graph", 
      3.0
    ], 
    [
      "How to hand sketch the phases", 
      3.0
    ], 
    [
      "Names of Microstructures of each point", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Not muddy", 
      0.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Confused as to what exactly each  phase is especially γ and Fe3C", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Eutectic stuff", 
      1.0
    ], 
    [
      "I'm still a little unclear on how to calculate the Fraction of each phase", 
      3.0
    ], 
    [
      "How FCC + BCC is relevant", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Platelet formation in pearlite", 
      2.0
    ], 
    [
      "Finding chem. composition + phase composition", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Understanding these different phase diagrams", 
      2.0
    ], 
    [
      "Chemical composition, Phase fraction", 
      2.0
    ], 
    [
      "The phase diagrams were difficult to understand", 
      2.0
    ], 
    [
      "How does cold working and material learned about processing materials effect our knowledge of phase diagrams?", 
      3.0
    ], 
    [
      "The aspect of what a eutectoid is", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Microstructures below Teutectic, why isn't there any eutectic α at eutectic reaction", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I don't know what 1020, 1060, or 10100 steel means", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Went through the TS + Ys stuff really fast", 
      1.0
    ], 
    [
      "What determines what kind of composition it is", 
      2.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "Just need to refresh on each phase what happened", 
      1.0
    ], 
    [
      "What we need to know for test", 
      1.0
    ], 
    [
      "When carbonate composite is lower or higher that Transition point, we could get pearlite after cooling γ ( Austenite) ? Is that true?", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The whole section about the solubility of Carbon FCC Fe vs. BCC Fe was very muddy in general", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Calculating phase fraction", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I don't quite understand the pearlite", 
      1.0
    ], 
    [
      "Chemical compositions", 
      1.0
    ]
  ], 
  [
    [
      "Nothing", 
      0.0
    ], 
    [
      "What heat treat is used for microstructure?", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Not sure if I understand", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "What happens if the materials is held at its quench temp. after it finishes its transformation?", 
      3.0
    ], 
    [
      "Nothing was too confusing, I understood most of it", 
      0.0
    ], 
    [
      "Differentiating the structures from the photos and why each photo is that type", 
      3.0
    ], 
    [
      "Difference between pearlite, Austinite, others", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Martensite? Confused by it's process and properties", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Heat treatment part 2- Martensite: How do you determine the crystal structure", 
      3.0
    ], 
    [
      "Pearlite, Astenite, etc. I don't know the difference between all these!", 
      2.0
    ], 
    [
      "TS & %el of the microstructures", 
      2.0
    ], 
    [
      "How the crystal structures are related to the martensite", 
      3.0
    ], 
    [
      "You should really creat a different/ simplified sets of note to give to student. Have you seen what some of these pictures look like in black and white? Eg. First slide from todays class", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Second activities, where were the dots for A, B, C, D?", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Microstructures", 
      1.0
    ], 
    [
      "How do you make a solid piece of gear with very hard teeth and a ductile body?", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Can phases be change straight from pearlite to bainite? Why must phase be cooled to room temp. as soon as microstructure is achieved?", 
      3.0
    ], 
    [
      "Why does it have to go through Eutectic point?", 
      2.0
    ], 
    [
      "How is martensite used? What applications would need very high strength w/ low ductilities?", 
      3.0
    ], 
    [
      "Relation to crystal structures. Tempering.", 
      2.0
    ], 
    [
      "Do the bainites actually have feather like microstructures or is that just representation?", 
      3.0
    ], 
    [
      "Why doesn't carbon diffuse in martensite?", 
      3.0
    ], 
    [
      "I found the martensite a little confusing", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Heat treatment for a given microstructure", 
      2.0
    ], 
    [
      "What are some applications of each of these microstructures? Are they all used or are some a lot more common?", 
      2.0
    ], 
    [
      "Why is it that the line *? Passes the finish time? Why can't it just stop at finish?", 
      1.0
    ], 
    [
      "Heating treatments of Microstructures", 
      2.0
    ], 
    [
      "The relationship between different charts", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Pretty clear today, no real questions", 
      0.0
    ], 
    [
      "How quickly do you need to cool the steel in order for it to keep designed microstructure when cooling to room temperature", 
      3.0
    ], 
    [
      "Some martensite points", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I had some uncertainties about the graphs but they were cleared up", 
      1.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "HW from yesterday", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I don't know how to read the graphs or what each part of the graphs (phase diagrams) interpret", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The intermediate temperature age hardening graph", 
      2.0
    ], 
    [
      "I don't understand the age hardening graphs, they are confusing", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Finding the times for artificial aging as in the last activity", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "N/A complete clairity", 
      0.0
    ], 
    [
      "Finding which alloys have age hardening with phase diagrams", 
      2.0
    ], 
    [
      "The heat treatment activity", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Homework… age hardening", 
      1.0
    ], 
    [
      "Activity- Heat treatment", 
      1.0
    ], 
    [
      "Microstructure of each step", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Heat treatment of Cu-Al alloy or phase diagram& hardness vs. log time curve", 
      2.0
    ], 
    [
      "Activity- Heat treatment", 
      1.0
    ], 
    [
      "Heat treatment time on activity", 
      1.0
    ], 
    [
      "Microstructures and heat treatment activity at end of class", 
      1.0
    ], 
    [
      "Duration vs. Ys graph", 
      2.0
    ], 
    [
      "Age hardening of metals", 
      2.0
    ], 
    [
      "Does this alter the microstructure of alloys?", 
      2.0
    ], 
    [
      "How to use two graphs to determine age hardening temperatures and solution treatment temperatures", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Determining temperatures for age-hardening", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Do materials continuously age? Or is there a point when their Ys is constant?", 
      3.0
    ], 
    [
      "The HW for last night was very confusing. Age hardening diagrams were also continuing", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How to know how long you heat for the solution treatment", 
      3.0
    ], 
    [
      "What are the differences between age hardening at elevated temperatures, annealing, and tempering?", 
      3.0
    ], 
    [
      "How do you determine where the temp. for quenching happens, where exactly is it located?", 
      3.0
    ], 
    [
      "none", 
      0.0
    ], 
    [
      "Just need to go over the process of hardening", 
      1.0
    ], 
    [
      "Don't understand graph during activity, with / α θ and θ", 
      2.0
    ], 
    [
      "Heat treatment temp. time", 
      2.0
    ], 
    [
      "The heat treatment activity", 
      1.0
    ], 
    [
      "If you keep it at the original temperature will the solution penetrate deeper?", 
      3.0
    ], 
    [
      "I'm fairly confused on how to actually find the temperatures and durations in which you need to heat an alloy in order to properly age harden the alloy (artificially)", 
      3.0
    ], 
    [
      "Microstructures (I just need to review personally)", 
      1.0
    ], 
    [
      "How precipitates work", 
      2.0
    ], 
    [
      "The mechanism by which age hardening creates barriers to dislocation motion. What exactly is going on when it is age hardened", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "", 
      0.0
    ], 
    [
      "How to know ? Based or structure", 
      1.0
    ], 
    [
      "Calculation M?", 
      1.0
    ], 
    [
      "I understood today's lesson well, I was very interested in the lesson. Probably because I had hand on materials", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "No problem", 
      0.0
    ], 
    [
      "It's sometimes hard to remember the classifications of the polymers", 
      1.0
    ], 
    [
      "Identifying polymers from name", 
      1.0
    ], 
    [
      "Names of polymers and mers", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Matching polymers with products", 
      2.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I am not quite sure how to find the DP of polymers", 
      2.0
    ], 
    [
      "Polymers", 
      1.0
    ], 
    [
      "Mers", 
      1.0
    ], 
    [
      "Structure of semi crystalline", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Polymer morphology", 
      1.0
    ], 
    [
      "Determining what polymers go with what polymer structure", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Whatever DP stood for", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How do the strain on polymers effect microstructure", 
      3.0
    ], 
    [
      "patency + type of polymer- not explained clearly", 
      2.0
    ], 
    [
      "What is a free-radical? Just a free electron on the R in R˙", 
      2.0
    ], 
    [
      "Call structures of polymers", 
      2.0
    ], 
    [
      "How are the polymer chains manipulated physically to switch components in the chain", 
      3.0
    ], 
    [
      "How the polymers names are given?", 
      2.0
    ], 
    [
      "I found the actual carbon + Hydrogen structure a little confusing", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Relation between transparency + types of polymers- not explained clearly\nAll the specific molecules/ ? In condensation - Don't know them so it really didn't make sense", 
      2.0
    ], 
    [
      "Do all polymers have a form of van der waals bonding & covalent, or is it only on certain chains?", 
      3.0
    ], 
    [
      "The effects on molecular weight and bonding on properties", 
      3.0
    ], 
    [
      "Pretty straight forward", 
      0.0
    ], 
    [
      "Calculating DP (n)", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The differences between polymers and classifying them at a molecular level was just a little muddy/ confusing", 
      2.0
    ], 
    [
      "N/A :)", 
      0.0
    ], 
    [
      "Properties of different polymers- how to tell difference between \"polystyrene\", \"polyethylene\", etc.", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I understood what we covered today in lecture", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I still cannot interpret graphs. They are confusing to me", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "No units on Log E vs. T curve graph on first page, and it appears like polymers are more viscous as Tem goes up", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Conduction", 
      1.0
    ], 
    [
      "Plastics processing- all the different types", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Heat ? Vs. thermoplastics polymers", 
      2.0
    ], 
    [
      "Where certain polymers go on Log E vs. T curve", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Glassy vs. viscous graph temps", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Relation of Ts and E; Tg", 
      2.0
    ], 
    [
      "Relation of Tg to E & properties of Thermoplastic polymers", 
      2.0
    ], 
    [
      "Understood most everything", 
      0.0
    ], 
    [
      "How does Tg differs from Tm", 
      2.0
    ], 
    [
      "Calendaring", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Tempering metals and their effects", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How to know where Tg is. Seems as if description on slide 2 doesn't match where we marked it on the graph as a class", 
      3.0
    ], 
    [
      "Still having a little trouble memorizing all the specific polymers, their types/ classifications, applications + processing", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The effects on molecular weight and bonding on properties", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The semi crystalline polymer morphology was just a little muddy; needed a little more explanation", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "What makes Kevlove? strong?", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "Microstructure", 
      1.0
    ], 
    [
      "How to tell which material is which structure", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I'm not sure if I should memorize Tg or if the reference sheet will be provided on tests", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I still don't understand how to determine which stress vs. strain curve goes with what material. I don't understand how to use the ductility Tm and Tg to determine the curve", 
      3.0
    ], 
    [
      "The meaning of the second line drawn on the log E vs. T graphs", 
      3.0
    ], 
    [
      "How to know plastics by their structure", 
      2.0
    ], 
    [
      "Log Modulus of elasticity vs. Temp. curve, GRAPH HARD TO READ", 
      2.0
    ], 
    [
      "Determining TM on a Log E vs. Temp graph", 
      2.0
    ], 
    [
      "Mers", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Everything", 
      1.0
    ], 
    [
      "How to tell which category polymers are in (Amorphous, semi crystalline, thermosetting, elastomer)", 
      3.0
    ], 
    [
      "Log E vs. Temp", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Strain, stress curves", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Why does the room temp. change on the graph for each types?", 
      3.0
    ], 
    [
      "Stress-Strain curves", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How does thermoset decompose?", 
      3.0
    ], 
    [
      "What the lines refer to in the effect of strain rate on Log E vs. T curves slide", 
      3.0
    ], 
    [
      "Why does polyoufadiene have a 0°C Tm on the hand-out? Wouldn't that make it a sticky mers at room temp?", 
      3.0
    ], 
    [
      "Effects of crosslinking & adding plasticizer\nNew curves on Log E vs. T curves", 
      3.0
    ], 
    [
      "Determination of Log E vs. T curve\nThe last part, seemed to rush through at end (polymer addition)", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I found the graphs to be a ? Confusing", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How to identify stress/strain curve for different polymers", 
      3.0
    ], 
    [
      "Rushed through various effects on Tm + Tg", 
      2.0
    ], 
    [
      "What happens when a polymer doesn't have a ? melting point?", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How to classify the polymer's microstructure?", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Why does the Log graph plat? Several times?", 
      3.0
    ], 
    [
      "I thought that the effect of strain rate on the Log E vs. T curves was just a little confusing", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Scaling the Log E vs. T graph, should room temp. be included on the graph?", 
      3.0
    ], 
    [
      "Sometimes what you write on the whiteboard makes no sense ? You write 5 things at once\nProcessing techniques still are confusing", 
      1.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "Band Gaps, Mobility, Conductivity → Entire Class", 
      1.0
    ], 
    [
      "Electron + Holes migration", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I understood most of today's lecture", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Does crystal structure affect conductivity? eg. Lattice size affects the distance of atoms from each other -> will this change the size of the energy bonds?", 
      3.0
    ], 
    [
      "Some of the calculations are confusing and I don't understand how to figure out how much of the conductivity is due to holes", 
      2.0
    ], 
    [
      "Which letter means what and how they relate : ρ, σ, Ω, ohms, watts, volts, etc.", 
      3.0
    ], 
    [
      "Difference between band gaps of different elements", 
      2.0
    ], 
    [
      "Electron energy band structure graph (brooms) only S, no P?", 
      2.0
    ], 
    [
      "Band Gaps", 
      1.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Why grain size ? increases conductivity", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Resistivity vs. Resistance", 
      1.0
    ], 
    [
      "Conductivity equation, how to find \"e\" and \"n\"?", 
      2.0
    ], 
    [
      "Reasons why metals are good conductors", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Why do impurities increase semiconductors conductivity?", 
      3.0
    ], 
    [
      "Why semiconductors are opposite from conductors", 
      3.0
    ], 
    [
      "Electronic structures", 
      1.0
    ], 
    [
      "Calculations", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The electronic structure of different materials ( Band gap, electron holes, etc.)", 
      1.0
    ], 
    [
      "How do these equations effect the atomic level process of e-holes", 
      3.0
    ], 
    [
      "The electron band graphs", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Valance bands in regards to their application", 
      2.0
    ], 
    [
      "Calculating conductivity with carrier density", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Why are metals the better vs. semiconductors?", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Electron energy band structures", 
      2.0
    ], 
    [
      "Energy state vs. Energy band (Slide 7-8), what are the \"12 states\" for the 2s electron band?", 
      3.0
    ], 
    [
      "How is the grain size affected by the conductivity, or ?", 
      3.0
    ], 
    [
      "Why conductivity will decrease with smaller size of grains", 
      3.0
    ], 
    [
      "Clear as mud", 
      0.0
    ], 
    [
      "How does grain size / grain boundary area affect conductivity in metals or semi-conductors", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I didn't understand how grain boundaries effect conductivity", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The electrical conductivity equation was pretty confusing and could use more explaining", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Why do electrons and holes move at different rates? How that physically possible?", 
      3.0
    ], 
    [
      "Nothing was unclear", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ]
  ], 
  [
    [
      "Gap size carrier", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "1st activity", 
      1.0
    ], 
    [
      "I understood quite a bit today, did the activity mostly on my own and got majority of them right", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Proper units and basic electrical laws + formula", 
      2.0
    ], 
    [
      "I don't understand the importance of energy levels in regards to semiconductors", 
      3.0
    ], 
    [
      "Calculating fractions/ ratio of conductivity from mobility of density contribution ne µe", 
      3.0
    ], 
    [
      "Minority vs. majority carriers also difference between equations of n+p type", 
      2.0
    ], 
    [
      "HW can be discouraging", 
      1.0
    ], 
    [
      "Slide 4", 
      1.0
    ], 
    [
      "Conductivity vs. Temp.", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Difference between n-type and p-type", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The material on post test", 
      1.0
    ], 
    [
      "n-type and p-type", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Conductivity equation", 
      1.0
    ], 
    [
      "Calculating conductivity", 
      1.0
    ], 
    [
      "Conduction/ valence band diagram", 
      2.0
    ], 
    [
      "How T affects semiconductors. We started talking about extrinsic/ intrinsic blah … --> confusion", 
      2.0
    ], 
    [
      "Nothing", 
      0.0
    ], 
    [
      "Why are units of conductivity (Ωm)-1?\nAlso, does the temperature/ conductivity relationship mean that a semiconductor, like (GaAs) is exhausted @ room temp.?", 
      3.0
    ], 
    [
      "Carries", 
      1.0
    ], 
    [
      "Rectifying junctions/ rectifiers", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Something that I found confusing was the carries. What are they?", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Exhaustion and saturated graphs- beside designing semiconductors to be in these area- what else do these graphs really tell you?", 
      3.0
    ], 
    [
      "What's the advantage of having conductivity lower than metals for use in electronics? (don't really understand what semiconductors do/ how they work in actual devices)", 
      3.0
    ], 
    [
      "Why the certain groups are either n-type or p-type", 
      2.0
    ], 
    [
      "n-type/ p-type increases conductivity", 
      2.0
    ], 
    [
      "Just a few characteristic issue", 
      1.0
    ], 
    [
      "Don't get the bad gap diagram?\nHow do you find fractional hole vs. electron?", 
      3.0
    ], 
    [
      "n-type, p-type? Do they have differences between conductivity by mechanism…", 
      3.0
    ], 
    [
      "I still don't know the answer to the pre/post test", 
      1.0
    ], 
    [
      "I wanted to talk more about diodes & transistors", 
      1.0
    ], 
    [
      "The electrical property concept questions explanations were just a little ? And it would've been nice to spend more time on them", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Names for semiconductors (\"avalanche diodes\", etc), forward/ reverse bias", 
      1.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "Verbiage", 
      1.0
    ], 
    [
      "I'm really confused by the exhaustion state shown on the graph, what ? It and why?", 
      2.0
    ]
  ], 
  [
    [
      "Intrinsic vs. Extrinsic Properties", 
      1.0
    ], 
    [
      "Avalanche diodes", 
      1.0
    ], 
    [
      "Avalanche diode", 
      1.0
    ], 
    [
      "I understood most of everything", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I am fine but I saw others in class getting … in the terminology and thus didn't understand the final concept", 
      0.0
    ], 
    [
      "I pretty much don't understand all of it. I think the pictures make it more confusing", 
      1.0
    ], 
    [
      "The purpose of each layer in MOSFET", 
      2.0
    ], 
    [
      "MOSFET", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Everything went by to fast, not enough … to understand", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Does bond strength have any relation to conductivity in metals & semiconductors", 
      3.0
    ], 
    [
      "What is the difference between MOSFET and a bipolar junction transistor", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Working of NPN junction transistor", 
      2.0
    ], 
    [
      "Avalanche Diode graph going to AC to DC conversion graph", 
      2.0
    ], 
    [
      "AC to DC conversion", 
      1.0
    ], 
    [
      "MOSFET", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "MOSFET process sequence", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "How polishing is done", 
      2.0
    ], 
    [
      "How does a dipolar junction transistor work & how does it differ from a MOSFET?", 
      3.0
    ], 
    [
      "MOSFET process sequence", 
      2.0
    ], 
    [
      "The way the transistors worked", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Just a little confused on how temperature affects conductivity", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Specifics of how the devices work, is the point of MOSFET to control the gate voltage to control conductivity?", 
      3.0
    ], 
    [
      "Everything was OK", 
      0.0
    ], 
    [
      "npn MOSFET process sequence", 
      2.0
    ], 
    [
      "How trasistors work?", 
      2.0
    ], 
    [
      "How does the PNP/ NPN thing work? How can you make the gate positive or negative?", 
      3.0
    ], 
    [
      "What's the usage of the gate in a device?", 
      3.0
    ], 
    [
      "Do holes present the same charge as electrons?", 
      3.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The explanation of the rectifying Junction and Avalanche Diode were, in general, just a little muddy", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I'm really confused by the exhaustion state shown on the graph, what ? It and why?", 
      2.0
    ]
  ], 
  [
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "Everything was understandable", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Crack tip stress concentration", 
      1.0
    ], 
    [
      "Heat treating glass and crack tip stress concentration", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "non, clear lecture today", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Effect on composition on high temp viscosity", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Major glass Temp and uses", 
      1.0
    ], 
    [
      "Composition and high Temp viscosity", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Viscosity", 
      1.0
    ], 
    [
      "Ceramics", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I was confused as to why some ceramics don't break easily?", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Atomic structure of glass ceramics (was not included in preview problem, skipped straight to processing?, explanation in class didn't go into detail about which bonds are ionic/ covalent, do you start w/ SiO2 then add an ion like just Ca? or add CaO?)", 
      3.0
    ], 
    [
      "Whatever was the review, whatever was written on the board was too blurry", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The effect of composition on high temperature viscosity was pretty confusing", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Ceramic processing- how does it work?", 
      2.0
    ]
  ], 
  [
    [
      "Hair polish", 
      1.0
    ], 
    [
      "What a refractory is?", 
      2.0
    ], 
    [
      "Polymorphic forms of carbon", 
      1.0
    ], 
    [
      "How to remember what is blown or slip casted", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "No problems", 
      0.0
    ], 
    [
      "The crustal structures are kind of hard to visualize", 
      1.0
    ], 
    [
      "Atomic radius/ ratio for relevance of charge in molecule", 
      2.0
    ], 
    [
      "Structure of different ceramics", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "ABX3 structure", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "Polymorphic forms of Carbon", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "None", 
      0.0
    ], 
    [
      "Tetrahedral bonding structure", 
      1.0
    ], 
    [
      "ceramics compositions", 
      1.0
    ], 
    [
      "The unit cell with atoms", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Ceramics processing", 
      1.0
    ], 
    [
      "Rock salt structure- why did we learn that? Refractories?", 
      2.0
    ], 
    [
      "The difference between slip casting and blowing and how to tell when an object is made by which process", 
      3.0
    ], 
    [
      "Why are the bottles green after slip casting?", 
      2.0
    ], 
    [
      "Diamond structure", 
      1.0
    ], 
    [
      "Tetrahedral bonding in diamond", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "I would like to learn the applications of the methods for the certain of materials", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Tetrahedron diamond structure", 
      1.0
    ], 
    [
      "Would like more detail on why certain compositions are for certain applications/ processing", 
      2.0
    ], 
    [
      "Not much", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Pretty straight forward", 
      0.0
    ], 
    [
      "How do you correspond glass type to materials/ object?", 
      3.0
    ], 
    [
      "Processing & blowing, what is the different?", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "The types of atomic bonding in ceramics could have been review just a little better", 
      1.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "Ceramic processing- how does it work?", 
      2.0
    ], 
    [
      "", 
      0.0
    ], 
    [
      "What does crystal structure actually mean in terms of the material's macroscopic properties", 
      3.0
    ], 
    [
      "Who will ever tell my random thoughts to once in graduate your class", 
      0.0
    ]
  ], 
  []
]